OdDAI.Select.getSchemaType
\details
Retrieves the current schema value type.
\returns Returns current schema value type.

OdDAI.Select.setValue(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value represented with an OdRxValue.
\param val [in] A new nested value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.getValue(OdRxValue*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as OdRxValue.
\param ret [out] A placeholder for the value to be returned to a calling subroutine.
\returns Returns true if the value was successfully extraced and returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getBinary(OdDAI.Binary*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as a binary value.
\param res [out] A placeholder for the raw pointer that refers to the binary data. This pointer is returned to a calling subroutine.
\returns Returns true if the value is successfully converted and the raw pointer is returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.getBinary(OdDAI.Binary**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current value as a binary value.
\param res [out] A placeholder for the raw pointer that refers to the binary data. This pointer is returned to a calling subroutine.
\returns Returns true if the value is successfully converted and the raw pointer is returned to a calling subroutine; otherwise, the method returns false.

OdDAI.Select.setNumber(OdDAI.Number!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new Number value.
\param val [in] A new Number value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setBinary(OdDAI.Binary!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value represented with a binary value.
\param val [in] A new value.
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.setBinary(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value represented with a binary value.
\param val [in] A new value in binary representation such as "010101110".
\returns Returns true if the value was successfully set; otherwise, the method returns false.

OdDAI.Select.op_Assign(OdDAI.Select*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The move assignment operator for the "Select" value.
\param other [in] Another value (right-hand operand of the move assignment operation).
\returns Returns a reference to the "Select" value after the assignment operation is done.

OdDAI.Select.#ctor(OdDAI.Select*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Move copy constructor.
\param other [in] Another value to be moved.